In [1]:
import sqlite3
import pandas as pd

In [2]:
df_transacoes = pd.read_csv("/content/TB_TRANSACOES_PROJETO_ECOMM.csv", delimiter=',')
df_clientes = pd.read_csv("/content/TB_CLIENTES_PROJETO_ECOMM.csv", delimiter=',')

In [3]:
# Verificar os nomes das colunas
print(df_transacoes.head())
print(df_clientes.head())

   id_client     Category   Price   Card_Type
0         37  Electronics   72,93  mastercard
1         38      Jewelry  121,89  mastercard
2         39         Baby    64,3  mastercard
3         40     Outdoors    9,48  mastercard
4          5     Outdoors   61,95  mastercard
   Id_client state_name First_name  Gender                     Job_Title
0          1         TX    Domingo    Male  Structural Analysis Engineer
1          2         MI    Russell    Male            Speech Pathologist
2          3         AL     Kimble    Male           Account Coordinator
3          4         IL   Barnabas    Male               General Manager
4          5         MN     Tanney  Female                  VP Marketing

In [4]:
# Substituir vírgula por ponto e converter para float
df_transacoes['Price'] = df_transacoes['Price'].str.replace(',', '.')
df_transacoes['Price'] = pd.to_numeric(df_transacoes['Price'])

In [5]:
df_transacoes.columns = df_transacoes.columns.str.strip().str.lower()
df_clientes.columns = df_clientes.columns.str.strip().str.lower()

In [6]:
print(df_transacoes.head())
print(df_clientes.head())

   id_client     category   price   card_type
0         37  Electronics   72.93  mastercard
1         38      Jewelry  121.89  mastercard
2         39         Baby   64.30  mastercard
3         40     Outdoors    9.48  mastercard
4          5     Outdoors   61.95  mastercard
   id_client state_name first_name  gender                     job_title
0          1         TX    Domingo    Male  Structural Analysis Engineer
1          2         MI    Russell    Male            Speech Pathologist
2          3         AL     Kimble    Male           Account Coordinator
3          4         IL   Barnabas    Male               General Manager
4          5         MN     Tanney  Female                  VP Marketing

In [7]:
conn = sqlite3.connect('projeto.db')
# Carregar o DataFrame no banco de dados SQLite - criando tb_transacoes e tb_clientes
df_transacoes.to_sql('tb_transacoes', conn, index=False, if_exists='replace')
df_clientes.to_sql('tb_clientes', conn, index=False, if_exists='replace')

175

In [8]:
# Função para executar consultas SQL e retornar o resultado como um DataFrame
def run_query(query):
    return pd.read_sql_query(query, conn)

In [9]:
import pandas as pd
import sqlite3

query = """
SELECT
    c.id_client,
    c.state_name,
    c.first_name,
    c.gender,
    c.job_title,
    t.category,
    t.price,
    t.card_type
FROM
    tb_clientes c
INNER JOIN
    tb_transacoes t
ON
    c.id_client = t.id_client;
"""

# Executar o JOIN
dados_unificados = pd.read_sql(query, conn)
print(dados_unificados.head())

# Exportar para CSV
dados_unificados.to_csv("dados_unificados.csv", index=False)

   id_client state_name first_name  gender                     job_title  \
0          1         TX    Domingo    Male  Structural Analysis Engineer
1          2         MI    Russell    Male            Speech Pathologist
2          3         AL     Kimble    Male           Account Coordinator
3          4         IL   Barnabas    Male               General Manager
4          5         MN     Tanney  Female                  VP Marketing

   category   price   card_type
0  Outdoors   16.97  mastercard
1   Grocery  143.39  mastercard
2     Music   37.64  mastercard
3   Jewelry    8.51  mastercard
4   Grocery   28.42  mastercard